package sudoku;

public class Main {

	public static void main(String[] args) {

		Sudoku s = new Sudoku();
		int[][] map = {
				{5,3,0,0,7,0,0,0,0},
				{6,0,0,1,9,5,0,0,0},
				{0,9,8,0,0,0,0,6,0},

				{8,0,0,0,6,0,0,0,3},
				{4,0,0,8,0,3,0,0,1},
				{7,0,0,0,2,0,0,0,6},

				{0,6,0,0,0,0,2,8,0},
				{0,0,0,4,1,9,0,0,5},
				{0,0,0,0,8,0,0,7,9}
		};
		/*


		int[][] map = {
				{0,0,0,0,9,0,0,0,0},
				{4,0,5,6,0,3,2,0,7},
				{0,0,8,5,0,1,9,0,0},

				{9,8,0,1,0,5,0,6,0},
				{3,0,0,0,6,0,0,0,5},
				{0,5,0,8,0,9,0,2,1},

				{0,0,6,9,0,4,3,0,0},
				{7,0,4,3,0,6,5,0,9},
				{0,0,0,0,2,0,0,0,0}
		};
				 */


		s.setGame(map);
		s.resolve();
		s.showGame();

		if(s.hasResolved()){
			System.out.println("Sudoku résolu!");
		}else{
			System.out.println("L'algo à du mal...");
		}
	}

}
